In [57]:
import pandas as pd
import numpy as np

In [58]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [59]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [60]:
df['Sex'].value_counts()

F    2
D    1
?    1
M    1
Name: Sex, dtype: int64

In [61]:
df['Sex'].replace('D', 'F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [62]:
df['Sex'].replace({'D': 'F', 'N': 'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [63]:
# If you have many columns to replace, you can do it this way:
df.replace({
    'Sex':{
        'D': 'F',
        'N': 'M'
    },
    'Age':{
        290: 29
    }
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

In the previous example, I explicitly replaced 290 with 29 (assuming it was just an extra 0 entered at data-entry phase). But what if you'd like to remove all the extra 0s from the ages columns? (example, 150 > 15, 490 > 49).

The first step would be to just set the limit of the "not possible" age. Is it 100? 120? Let's say that anything above 100 isn't credible for our dataset. We can then combine boolean selection with the operation:

In [64]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [65]:
df[df['Age'] > 100]

  Sex  Age
3   D  290

In [66]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age']/10

# This line of code actually modifies the original dataframe

In [67]:
df

  Sex   Age
0   M  29.0
1   F  30.0
2   F  24.0
3   D  29.0
4   ?  25.0

### Duplicates

In [68]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
],
    index = [
        'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
    ]
)
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [69]:
ambassadors.duplicated()

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [70]:
# This program didn't consider Kim Darroch and Peter Wittig as
# duplicated because by default the first instance is not 
# considered duplicate

# you can change this behavior in this way:
ambassadors.duplicated(keep='last')

Gérard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [71]:
# you can also make all of them as duplicates in this way:

ambassadors.duplicated(keep=False)

Gérard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [72]:
# If you want to remove duplicated values, you can do in this way:
ambassadors.drop_duplicates()

Gérard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [73]:
# you can also use keep parameter like above :)

In [74]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [75]:
# in this example Kobe Bryant name comes in three different
# position but this position comes same in only two places

players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [76]:
# Here the index no 4 is considered false though the name is 
# repeated. It is because name and position both is taken into 
# consideration. The name is repeated but since pos 'SF' is unique
# it is considered not duplicate

In [77]:
# We can check for every columns in this way:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [78]:
players.duplicated(subset=['Pos'])

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [79]:
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [80]:
players.drop_duplicates(subset=['Name'], keep='last')

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [81]:
players.drop_duplicates(subset=["Name"], keep=False)

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF

### Text handling

Cleaning text values can be incredibly hard. Invalid text values involves, 99% of the time, mistyping, which is completely unpredictable and doesn't follow any pattern. Thankfully, it's not so common these days, where data-entry tasks have been replaced by machines. Still, let's explore the most common cases:

Splitting Columns
The result of a survey is loaded and this is what you get:

In [82]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [83]:
df['Data'].str.split('_', expand=True)

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [84]:
df = df['Data'].str.split('_', expand=True)

In [85]:
df.columns = ['Year', 'Sex', 'Country', 'No. Children']

In [86]:
df

    Year Sex Country No. Children
0   1987   M     US             1
1  1990?   M      UK            1
2   1992   F      US            2
3  1970?   M      IT            1
4   1985   F    I  T            2

In [87]:
# If you want to remove the blank spaces in country column
df['Country'] = df['Country'].str.strip()

In [88]:
df

    Year Sex Country No. Children
0   1987   M      US            1
1  1990?   M      UK            1
2   1992   F      US            2
3  1970?   M      IT            1
4   1985   F    I  T            2

In [89]:
df['Year'] = df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

<ipython-input-89-6dabffbd1232>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['Year'] = df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

In [90]:
df

   Year Sex Country No. Children
0  1987   M      US            1
1  1990   M      UK            1
2  1992   F      US            2
3  1970   M      IT            1
4  1985   F    I  T            2